{"format": "layers-model", "generatedBy": "keras v2.2.4-tf", "convertedBy": "TensorFlow.js Converter v4.13.0", "modelTopology": {"keras_version": "2.2.4-tf", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "config": {"ragged": false, "dtype": "float32", "batch_input_shape": [null, 224, 224, 3], "name": "input_1", "sparse": false}, "inbound_nodes": [], "name": "input_1"}, {"class_name": "ZeroPadding2D", "config": {"padding": [[0, 1], [0, 1]], "dtype": "float32", "trainable": true, "name": "Conv1_pad", "data_format": "channels_last"}, "inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "Conv1_pad"}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "name": "Conv1", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [2, 2], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["Conv1_pad", 0, 0, {}]]], "name": "Conv1"}, {"class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn_Conv1", "gamma_regularizer": null, "dtype": "float32", "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.999, "axis": [3]}, "inbound_nodes": [[["Conv1", 0, 0, {}]]], "name": "bn_Conv1"}, {"class_name": "ReLU", "config": {"name": "Conv1_relu", "dtype": "float32", "trainable": true, "max_value": 6.0, "threshold": 0.0, "negative_slope": 0.0}, "inbound_nodes": [[["bn_Conv1", 0, 0, {}]]], "name": "Conv1_relu"}, {"class_name": "DepthwiseConv2D", "config": {"depth_multiplier": 1, "name": "expanded_conv_depthwise", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "depthwise_constraint": null, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["Conv1_relu", 0, 0, {}]]], "name": "expanded_conv_depthwise"}, {"class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "expanded_conv_depthwise_BN", "gamma_regularizer": null, "dtype": "float32", "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.999, "axis": [3]}, "inbound_nodes": [[["expanded_conv_depthwise", 0, 0, {}]]], "name": "expanded_conv_depthwise_BN"}, {"class_name": "ReLU", "config": {"name": "expanded_conv_depthwise_relu", "dtype": "float32", "trainable": true, "max_value": 6.0, "threshold": 0.0, "negative_slope": 0.0}, "inbound_nodes": [[["expanded_conv_depthwise_BN", 0, 0, {}]]], "name": "expanded_conv_depthwise_relu"}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "name": "expanded_conv_project", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 16, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["expanded_conv_depthwise_relu", 0, 0, {}]]], "name": "expanded_conv_project"}, {"class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "expanded_conv_project_BN", "gamma_regularizer": null, "dtype": "float32", "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.999, "axis": [3]}, "inbound_nodes": [[["expanded_conv_project", 0, 0, {}]]], "name": "expanded_conv_project_BN"}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "name": "block_1_expand", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 96, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["expanded_conv_project_BN", 0, 0, {}]]], "name": "block_1_expand"}, {"class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "block_1_expand_BN", "gamma_regularizer": null, "dtype": "float32", "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.999, "axis": [3]}, "inbound_nodes": [[["block_1_expand", 0, 0, {}]]], "name": "block_1_expand_BN"}, {"class_name": "ReLU", "config": {"name": "block_1_expand_relu", "dtype": "float32", "trainable": true, "max_value": 6.0, "threshold": 0.0, "negative_slope": 0.0}, "inbound_nodes": [[["block_1_expand_BN", 0, 0, {}]]], "name": "block_1_expand_relu"}, {"class_name": "ZeroPadding2D", "config": {"padding": [[0, 1], [0, 1]], "dtype": "float32", "trainable": true, "name": "block_1_pad", "data_format": "channels_last"}, "inbound_nodes": [[["block_1_expand_relu", 0, 0, {}]]], "name": "block_1_pad"}, {"class_name": "DepthwiseConv2D", "config": {"depth_multiplier": 1, "name": "block_1_depthwise", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "depthwise_constraint": null, "data_format": "channels_last", "padding": "valid", "strides": [2, 2], "dilation_rate": [1, 1], "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["block_1_pad", 0, 0, {}]]], "name": "block_1_depthwise"}, {"class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "block_1_depthwise_BN", "gamma_regularizer": null, "dtype": "float32", "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.999, "axis": [3]}, "inbound_nodes": [[["block_1_depthwise", 0, 0, {}]]], "name": "block_1_depthwise_BN"}, {"class_name": "ReLU", "config": {"name": "block_1_depthwise_relu", "dtype": "float32", "trainable": true, "max_value": 6.0, "threshold": 0.0, "negative_slope": 0.0}, "inbound_nodes": [[["block_1_depthwise_BN", 0, 0, {}]]], "name": "block_1_depthwise_relu"}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "name": "block_1_project", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 24, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["block_1_depthwise_relu", 0, 0, {}]]], "name": "block_1_project"}, {"class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "block_1_project_BN", "gamma_regularizer": null, "dtype": "float32", "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.999, "axis": [3]}, "inbound_nodes": [[["block_1_project", 0, 0, {}]]], "name": "block_1_project_BN"}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "name": "block_2_expand", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 144, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["block_1_project_BN", 0, 0, {}]]], "name": "block_2_expand"}, {"class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "block_2_expand_BN", "gamma_regularizer": null, "dtype": "float32", "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.999, "axis": [3]}, "inbound_nodes": [[["block_2_expand", 0, 0, {}]]], "name": "block_2_expand_BN"}, {"class_name": "ReLU", "config": {"name": "block_2_expand_relu", "dtype": "float32", "trainable": true, "max_value": 6.0, "threshold": 0.0, "negative_slope": 0.0}, "inbound_nodes": [[["block_2_expand_BN", 0, 0, {}]]], "name": "block_2_expand_relu"}, {"class_name": "DepthwiseConv2D", "config": {"depth_multiplier": 1, "name": "block_2_depthwise", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "depthwise_constraint": null, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["block_2_expand_relu", 0, 0, {}]]], "name": "block_2_depthwise"}, {"class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "block_2_depthwise_BN", "gamma_regularizer": null, "dtype": "float32", "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.999, "axis": [3]}, "inbound_nodes": [[["block_2_depthwise", 0, 0, {}]]], "name": "block_2_depthwise_BN"}, {"class_name": "ReLU", "config": {"name": "block_2_depthwise_relu", "dtype": "float32", "trainable": true, "max_value": 6.0, "threshold": 0.0, "negative_slope": 0.0}, "inbound_nodes": [[["block_2_depthwise_BN", 0, 0, {}]]], "name": "block_2_depthwise_relu"}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "name": "block_2_project", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 24, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["block_2_depthwise_relu", 0, 0, {}]]], "name": "block_2_project"}, {"class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "block_2_project_BN", "gamma_regularizer": null, "dtype": "float32", "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.999, "axis": [3]}, "inbound_nodes": [[["block_2_project", 0, 0, {}]]], "name": "block_2_project_BN"}, {"class_name": "Add", "config": {"dtype": "float32", "trainable": true, "name": "block_2_add"}, "inbound_nodes": [[["block_1_project_BN", 0, 0, {}], ["block_2_project_BN", 0, 0, {}]]], "name": "block_2_add"}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "name": "block_3_expand", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 144, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["block_2_add", 0, 0, {}]]], "name": "block_3_expand"}, {"class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "block_3_expand_BN", "gamma_regularizer": null, "dtype": "float32", "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.999, "axis": [3]}, "inbound_nodes": [[["block_3_expand", 0, 0, {}]]], "name": "block_3_expand_BN"}, {"class_name": "ReLU", "config": {"name": "block_3_expand_relu", "dtype": "float32", "trainable": true, "max_value": 6.0, "threshold": 0.0, "negative_slope": 0.0}, "inbound_nodes": [[["block_3_expand_BN", 0, 0, {}]]], "name": "block_3_expand_relu"}, {"class_name": "ZeroPadding2D", "config": {"padding": [[0, 1], [0, 1]], "dtype": "float32", "trainable": true, "name": "block_3_pad", "data_format": "channels_last"}, "inbound_nodes": [[["block_3_expand_relu", 0, 0, {}]]], "name": "block_3_pad"}, {"class_name": "DepthwiseConv2D", "config": {"depth_multiplier": 1, "name": "block_3_depthwise", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "depthwise_constraint": null, "data_format": "channels_last", "padding": "valid", "strides": [2, 2], "dilation_rate": [1, 1], "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["block_3_pad", 0, 0, {}]]], "name": "block_3_depthwise"}, {"class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "block_3_depthwise_BN", "gamma_regularizer": null, "dtype": "float32", "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.999, "axis": [3]}, "inbound_nodes": [[["block_3_depthwise", 0, 0, {}]]], "name": "block_3_depthwise_BN"}, {"class_name": "ReLU", "config": {"name": "block_3_depthwise_relu", "dtype": "float32", "trainable": true, "max_value": 6.0, "threshold": 0.0, "negative_slope": 0.0}, "inbound_nodes": [[["block_3_depthwise_BN", 0, 0, {}]]], "name": "block_3_depthwise_relu"}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "name": "block_3_project", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["block_3_depthwise_relu", 0, 0, {}]]], "name": "block_3_project"}, {"class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "block_3_project_BN", "gamma_regularizer": null, "dtype": "float32", "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.999, "axis": [3]}, "inbound_nodes": [[["block_3_project", 0, 0, {}]]], "name": "block_3_project_BN"}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "name": "block_4_expand", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 192, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["block_3_project_BN", 0, 0, {}]]], "name": "block_4_expand"}, {"class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "block_4_expand_BN", "gamma_regularizer": null, "dtype": "float32", "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.999, "axis": [3]}, "inbound_nodes": [[["block_4_expand", 0, 0, {}]]], "name": "block_4_expand_BN"}, {"class_name": "ReLU", "config": {"name": "block_4_expand_relu", "dtype": "float32", "trainable": true, "max_value": 6.0, "threshold": 0.0, "negative_slope": 0.0}, "inbound_nodes": [[["block_4_expand_BN", 0, 0, {}]]], "name": "block_4_expand_relu"}, {"class_name": "DepthwiseConv2D", "config": {"depth_multiplier": 1, "name": "block_4_depthwise", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "depthwise_constraint": null, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["block_4_expand_relu", 0, 0, {}]]], "name": "block_4_depthwise"}, {"class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "block_4_depthwise_BN", "gamma_regularizer": null, "dtype": "float32", "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.999, "axis": [3]}, "inbound_nodes": [[["block_4_depthwise", 0, 0, {}]]], "name": "block_4_depthwise_BN"}, {"class_name": "ReLU", "config": {"name": "block_4_depthwise_relu", "dtype": "float32", "trainable": true, "max_value": 6.0, "threshold": 0.0, "negative_slope": 0.0}, "inbound_nodes": [[["block_4_depthwise_BN", 0, 0, {}]]], "name": "block_4_depthwise_relu"}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "name": "block_4_project", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["block_4_depthwise_relu", 0, 0, {}]]], "name": "block_4_project"}, {"class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "block_4_project_BN", "gamma_regularizer": null, "dtype": "float32", "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.999, "axis": [3]}, "inbound_nodes": [[["block_4_project", 0, 0, {}]]], "name": "block_4_project_BN"}, {"class_name": "Add", "config": {"dtype": "float32", "trainable": true, "name": "block_4_add"}, "inbound_nodes": [[["block_3_project_BN", 0, 0, {}], ["block_4_project_BN", 0, 0, {}]]], "name": "block_4_add"}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "name": "block_5_expand", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 192, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["block_4_add", 0, 0, {}]]], "name": "block_5_expand"}, {"class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "block_5_expand_BN", "gamma_regularizer": null, "dtype": "float32", "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.999, "axis": [3]}, "inbound_nodes": [[["block_5_expand", 0, 0, {}]]], "name": "block_5_expand_BN"}, {"class_name": "ReLU", "config": {"name": "block_5_expand_relu", "dtype": "float32", "trainable": true, "max_value": 6.0, "threshold": 0.0, "negative_slope": 0.0}, "inbound_nodes": [[["block_5_expand_BN", 0, 0, {}]]], "name": "block_5_expand_relu"}, {"class_name": "DepthwiseConv2D", "config": {"depth_multiplier": 1, "name": "block_5_depthwise", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "depthwise_constraint": null, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["block_5_expand_relu", 0, 0, {}]]], "name": "block_5_depthwise"}, {"class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "block_5_depthwise_BN", "gamma_regularizer": null, "dtype": "float32", "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.999, "axis": [3]}, "inbound_nodes": [[["block_5_depthwise", 0, 0, {}]]], "name": "block_5_depthwise_BN"}, {"class_name": "ReLU", "config": {"name": "block_5_depthwise_relu", "dtype": "float32", "trainable": true, "max_value": 6.0, "threshold": 0.0, "negative_slope": 0.0}, "inbound_nodes": [[["block_5_depthwise_BN", 0, 0, {}]]], "name": "block_5_depthwise_relu"}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "name": "block_5_project", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["block_5_depthwise_relu", 0, 0, {}]]], "name": "block_5_project"}, {"class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "block_5_project_BN", "gamma_regularizer": null, "dtype": "float32", "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.999, "axis": [3]}, "inbound_nodes": [[["block_5_project", 0, 0, {}]]], "name": "block_5_project_BN"}, {"class_name": "Add", "config": {"dtype": "float32", "trainable": true, "name": "block_5_add"}, "inbound_nodes": [[["block_4_add", 0, 0, {}], ["block_5_project_BN", 0, 0, {}]]], "name": "block_5_add"}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "name": "block_6_expand", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 192, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["block_5_add", 0, 0, {}]]], "name": "block_6_expand"}, {"class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "block_6_expand_BN", "gamma_regularizer": null, "dtype": "float32", "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.999, "axis": [3]}, "inbound_nodes": [[["block_6_expand", 0, 0, {}]]], "name": "block_6_expand_BN"}, {"class_name": "ReLU", "config": {"name": "block_6_expand_relu", "dtype": "float32", "trainable": true, "max_value": 6.0, "threshold": 0.0, "negative_slope": 0.0}, "inbound_nodes": [[["block_6_expand_BN", 0, 0, {}]]], "name": "block_6_expand_relu"}, {"class_name": "ZeroPadding2D", "config": {"padding": [[0, 1], [0, 1]], "dtype": "float32", "trainable": true, "name": "block_6_pad", "data_format": "channels_last"}, "inbound_nodes": [[["block_6_expand_relu", 0, 0, {}]]], "name": "block_6_pad"}, {"class_name": "DepthwiseConv2D", "config": {"depth_multiplier": 1, "name": "block_6_depthwise", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "depthwise_constraint": null, "data_format": "channels_last", "padding": "valid", "strides": [2, 2], "dilation_rate": [1, 1], "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["block_6_pad", 0, 0, {}]]], "name": "block_6_depthwise"}, {"class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "block_6_depthwise_BN", "gamma_regularizer": null, "dtype": "float32", "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.999, "axis": [3]}, "inbound_nodes": [[["block_6_depthwise", 0, 0, {}]]], "name": "block_6_depthwise_BN"}, {"class_name": "ReLU", "config": {"name": "block_6_depthwise_relu", "dtype": "float32", "trainable": true, "max_value": 6.0, "threshold": 0.0, "negative_slope": 0.0}, "inbound_nodes": [[["block_6_depthwise_BN", 0, 0, {}]]], "name": "block_6_depthwise_relu"}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "name": "block_6_project", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["block_6_depthwise_relu", 0, 0, {}]]], "name": "block_6_project"}, {"class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "block_6_project_BN", "gamma_regularizer": null, "dtype": "float32", "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.999, "axis": [3]}, "inbound_nodes": [[["block_6_project", 0, 0, {}]]], "name": "block_6_project_BN"}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "name": "block_7_expand", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 384, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["block_6_project_BN", 0, 0, {}]]], "name": "block_7_expand"}, {"class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "block_7_expand_BN", "gamma_regularizer": null, "dtype": "float32", "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.999, "axis": [3]}, "inbound_nodes": [[["block_7_expand", 0, 0, {}]]], "name": "block_7_expand_BN"}, {"class_name": "ReLU", "config": {"name": "block_7_expand_relu", "dtype": "float32", "trainable": true, "max_value": 6.0, "threshold": 0.0, "negative_slope": 0.0}, "inbound_nodes": [[["block_7_expand_BN", 0, 0, {}]]], "name": "block_7_expand_relu"}, {"class_name": "DepthwiseConv2D", "config": {"depth_multiplier": 1, "name": "block_7_depthwise", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "depthwise_constraint": null, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["block_7_expand_relu", 0, 0, {}]]], "name": "block_7_depthwise"}, {"class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "block_7_depthwise_BN", "gamma_regularizer": null, "dtype": "float32", "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.999, "axis": [3]}, "inbound_nodes": [[["block_7_depthwise", 0, 0, {}]]], "name": "block_7_depthwise_BN"}, {"class_name": "ReLU", "config": {"name": "block_7_depthwise_relu", "dtype": "float32", "trainable": true, "max_value": 6.0, "threshold": 0.0, "negative_slope": 0.0}, "inbound_nodes": [[["block_7_depthwise_BN", 0, 0, {}]]], "name": "block_7_depthwise_relu"}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "name": "block_7_project", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["block_7_depthwise_relu", 0, 0, {}]]], "name": "block_7_project"}, {"class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "block_7_project_BN", "gamma_regularizer": null, "dtype": "float32", "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.999, "axis": [3]}, "inbound_nodes": [[["block_7_project", 0, 0, {}]]], "name": "block_7_project_BN"}, {"class_name": "Add", "config": {"dtype": "float32", "trainable": true, "name": "block_7_add"}, "inbound_nodes": [[["block_6_project_BN", 0, 0, {}], ["block_7_project_BN", 0, 0, {}]]], "name": "block_7_add"}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "name": "block_8_expand", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 384, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["block_7_add", 0, 0, {}]]], "name": "block_8_expand"}, {"class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "block_8_expand_BN", "gamma_regularizer": null, "dtype": "float32", "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.999, "axis": [3]}, "inbound_nodes": [[["block_8_expand", 0, 0, {}]]], "name": "block_8_expand_BN"}, {"class_name": "ReLU", "config": {"name": "block_8_expand_relu", "dtype": "float32", "trainable": true, "max_value": 6.0, "threshold": 0.0, "negative_slope": 0.0}, "inbound_nodes": [[["block_8_expand_BN", 0, 0, {}]]], "name": "block_8_expand_relu"}, {"class_name": "DepthwiseConv2D", "config": {"depth_multiplier": 1, "name": "block_8_depthwise", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "depthwise_constraint": null, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["block_8_expand_relu", 0, 0, {}]]], "name": "block_8_depthwise"}, {"class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "block_8_depthwise_BN", "gamma_regularizer": null, "dtype": "float32", "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.999, "axis": [3]}, "inbound_nodes": [[["block_8_depthwise", 0, 0, {}]]], "name": "block_8_depthwise_BN"}, {"class_name": "ReLU", "config": {"name": "block_8_depthwise_relu", "dtype": "float32", "trainable": true, "max_value": 6.0, "threshold": 0.0, "negative_slope": 0.0}, "inbound_nodes": [[["block_8_depthwise_BN", 0, 0, {}]]], "name": "block_8_depthwise_relu"}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "name": "block_8_project", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["block_8_depthwise_relu", 0, 0, {}]]], "name": "block_8_project"}, {"class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "block_8_project_BN", "gamma_regularizer": null, "dtype": "float32", "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.999, "axis": [3]}, "inbound_nodes": [[["block_8_project", 0, 0, {}]]], "name": "block_8_project_BN"}, {"class_name": "Add", "config": {"dtype": "float32", "trainable": true, "name": "block_8_add"}, "inbound_nodes": [[["block_7_add", 0, 0, {}], ["block_8_project_BN", 0, 0, {}]]], "name": "block_8_add"}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "name": "block_9_expand", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 384, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["block_8_add", 0, 0, {}]]], "name": "block_9_expand"}, {"class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "block_9_expand_BN", "gamma_regularizer": null, "dtype": "float32", "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.999, "axis": [3]}, "inbound_nodes": [[["block_9_expand", 0, 0, {}]]], "name": "block_9_expand_BN"}, {"class_name": "ReLU", "config": {"name": "block_9_expand_relu", "dtype": "float32", "trainable": true, "max_value": 6.0, "threshold": 0.0, "negative_slope": 0.0}, "inbound_nodes": [[["block_9_expand_BN", 0, 0, {}]]], "name": "block_9_expand_relu"}, {"class_name": "DepthwiseConv2D", "config": {"depth_multiplier": 1, "name": "block_9_depthwise", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "depthwise_constraint": null, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["block_9_expand_relu", 0, 0, {}]]], "name": "block_9_depthwise"}, {"class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "block_9_depthwise_BN", "gamma_regularizer": null, "dtype": "float32", "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.999, "axis": [3]}, "inbound_nodes": [[["block_9_depthwise", 0, 0, {}]]], "name": "block_9_depthwise_BN"}, {"class_name": "ReLU", "config": {"name": "block_9_depthwise_relu", "dtype": "float32", "trainable": true, "max_value": 6.0, "threshold": 0.0, "negative_slope": 0.0}, "inbound_nodes": [[["block_9_depthwise_BN", 0, 0, {}]]], "name": "block_9_depthwise_relu"}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "name": "block_9_project", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["block_9_depthwise_relu", 0, 0, {}]]], "name": "block_9_project"}, {"class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "block_9_project_BN", "gamma_regularizer": null, "dtype": "float32", "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.999, "axis": [3]}, "inbound_nodes": [[["block_9_project", 0, 0, {}]]], "name": "block_9_project_BN"}, {"class_name": "Add", "config": {"dtype": "float32", "trainable": true, "name": "block_9_add"}, "inbound_nodes": [[["block_8_add", 0, 0, {}], ["block_9_project_BN", 0, 0, {}]]], "name": "block_9_add"}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "name": "block_10_expand", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 384, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["block_9_add", 0, 0, {}]]], "name": "block_10_expand"}, {"class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "block_10_expand_BN", "gamma_regularizer": null, "dtype": "float32", "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.999, "axis": [3]}, "inbound_nodes": [[["block_10_expand", 0, 0, {}]]], "name": "block_10_expand_BN"}, {"class_name": "ReLU", "config": {"name": "block_10_expand_relu", "dtype": "float32", "trainable": true, "max_value": 6.0, "threshold": 0.0, "negative_slope": 0.0}, "inbound_nodes": [[["block_10_expand_BN", 0, 0, {}]]], "name": "block_10_expand_relu"}, {"class_name": "DepthwiseConv2D", "config": {"depth_multiplier": 1, "name": "block_10_depthwise", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "depthwise_constraint": null, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["block_10_expand_relu", 0, 0, {}]]], "name": "block_10_depthwise"}, {"class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "block_10_depthwise_BN", "gamma_regularizer": null, "dtype": "float32", "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.999, "axis": [3]}, "inbound_nodes": [[["block_10_depthwise", 0, 0, {}]]], "name": "block_10_depthwise_BN"}, {"class_name": "ReLU", "config": {"name": "block_10_depthwise_relu", "dtype": "float32", "trainable": true, "max_value": 6.0, "threshold": 0.0, "negative_slope": 0.0}, "inbound_nodes": [[["block_10_depthwise_BN", 0, 0, {}]]], "name": "block_10_depthwise_relu"}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "name": "block_10_project", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 96, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, 